---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.ForwardIterator
source: html/e5a802ca-df92-7d4b-a403-624e7816d1ad.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveByPointsArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.